; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker_empty_level ?s - shaker ?l - level)
		(shaker_level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail_part1 ?c - cocktail ?i - ingredient)
                (cocktail_part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill_shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill_shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty_shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean_shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour_shot_to_clean_shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker_level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker_level ?d ?l))
			(shaker_level ?d ?l1)))


  (:action pour_shot_to_used_shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker_level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker_level ?d ?l))
			(shaker_level ?d ?l1)))

  (:action empty_shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker_level ?s ?l)
			      (shaker_empty_level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker_level ?s ?l))
	   	   	(shaker_level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean_shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail_part1 ?b ?d1)
			      (cocktail_part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour_shaker_to_shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker_level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker_level ?s ?l1)
			(not (shaker_level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
     shaker1 - shaker
     left right - hand
     shot1 shot2 shot3 shot4 shot5 - shot
     ingredient1 ingredient2 ingredient3 - ingredient
     cocktail1 cocktail2 cocktail3 - cocktail
     dispenser1 dispenser2 dispenser3 - dispenser
     l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (dispenses dispenser3 ingredient3)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (handempty left)
  (handempty right)
  (shaker_empty_level shaker1 l0)
  (shaker_level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail_part1 cocktail1 ingredient2)
  (cocktail_part2 cocktail1 ingredient1)
  (cocktail_part1 cocktail2 ingredient2)
  (cocktail_part2 cocktail2 ingredient1)
  (cocktail_part1 cocktail3 ingredient2)
  (cocktail_part2 cocktail3 ingredient3)
)
 (:goal
  (and
     (contains shot1 cocktail2)
     (contains shot2 cocktail1)
     (contains shot3 cocktail3)
     (contains shot4 ingredient1)
)))

; plan
1. (grasp right shot1)
   deleted: (ontable shot1) (handempty right)
   added: (holding right shot1)
   goals met: 0 of 4
2. (fill_shot shot1 ingredient2 right left dispenser2)
   deleted: (empty shot1) (clean shot1)
   added: (contains shot1 ingredient2) (used shot1 ingredient2)
   goals met: 0 of 4
3. (grasp left shot4)
   deleted: (ontable shot4) (handempty left)
   added: (holding left shot4)
   goals met: 0 of 4
4. (pour_shot_to_clean_shaker shot1 ingredient2 shaker1 right l0 l1)
   deleted: (contains shot1 ingredient2) (empty shaker1) (clean shaker1) (shaker_level shaker1 l0)
   added: (empty shot1) (contains shaker1 ingredient2) (unshaked shaker1) (shaker_level shaker1 l1)
   goals met: 0 of 4
5. (leave left shot4)
   deleted: (holding left shot4)
   added: (handempty left) (ontable shot4)
   goals met: 0 of 4
6. (clean_shot shot1 ingredient2 right left)
   deleted: (used shot1 ingredient2)
   added: (clean shot1)
   goals met: 0 of 4
7. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 4
8. (leave right shot1)
   deleted: (holding right shot1)
   added: (handempty right) (ontable shot1)
   goals met: 0 of 4
9. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 0 of 4
10. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 0 of 4
11. (fill_shot shot4 ingredient1 right left dispenser1)
   deleted: (empty shot4) (clean shot4)
   added: (contains shot4 ingredient1) (used shot4 ingredient1)
   goals met: 1 of 4
12. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
13. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 1 of 4
14. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
15. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 1 of 4
16. (grasp left shot5)
   deleted: (ontable shot5) (handempty left)
   added: (holding left shot5)
   goals met: 1 of 4
17. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 1 of 4
18. (fill_shot shot5 ingredient2 left right dispenser2)
   deleted: (empty shot5) (clean shot5)
   added: (contains shot5 ingredient2) (used shot5 ingredient2)
   goals met: 1 of 4
19. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 1 of 4
20. (leave left shot5)
   deleted: (holding left shot5)
   added: (handempty left) (ontable shot5)
   goals met: 1 of 4
21. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 1 of 4
22. (grasp right shot2)
   deleted: (ontable shot2) (handempty right)
   added: (holding right shot2)
   goals met: 1 of 4
23. (fill_shot shot2 ingredient3 right left dispenser3)
   deleted: (empty shot2) (clean shot2)
   added: (contains shot2 ingredient3) (used shot2 ingredient3)
   goals met: 1 of 4
24. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
25. (pour_shot_to_used_shaker shot2 ingredient3 shaker1 right l1 l2)
   deleted: (contains shot2 ingredient3) (shaker_level shaker1 l1)
   added: (contains shaker1 ingredient3) (empty shot2) (shaker_level shaker1 l2)
   goals met: 1 of 4
26. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
27. (clean_shot shot2 ingredient3 right left)
   deleted: (used shot2 ingredient3)
   added: (clean shot2)
   goals met: 1 of 4
28. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
29. (leave right shot2)
   deleted: (holding right shot2)
   added: (handempty right) (ontable shot2)
   goals met: 1 of 4
30. (shake cocktail3 ingredient2 ingredient3 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient3)
   added: (shaked shaker1) (contains shaker1 cocktail3)
   goals met: 1 of 4
31. (pour_shaker_to_shot cocktail3 shot3 left shaker1 l2 l1)
   deleted: (clean shot3) (empty shot3) (shaker_level shaker1 l2)
   added: (contains shot3 cocktail3) (shaker_level shaker1 l1)
   goals met: 2 of 4
32. (empty_shaker left shaker1 cocktail3 l1 l0)
   deleted: (shaked shaker1) (shaker_level shaker1 l1) (contains shaker1 cocktail3)
   added: (shaker_level shaker1 l0) (empty shaker1)
   goals met: 2 of 4
33. (clean_shaker left right shaker1)
   added: (clean shaker1)
   goals met: 2 of 4
34. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 2 of 4
35. (pour_shot_to_clean_shaker shot4 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot4 ingredient1) (empty shaker1) (clean shaker1) (shaker_level shaker1 l0)
   added: (empty shot4) (contains shaker1 ingredient1) (unshaked shaker1) (shaker_level shaker1 l1)
   goals met: 1 of 4
36. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 1 of 4
37. (grasp right shot1)
   deleted: (ontable shot1) (handempty right)
   added: (holding right shot1)
   goals met: 1 of 4
38. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
39. (fill_shot shot1 ingredient2 right left dispenser2)
   deleted: (empty shot1) (clean shot1)
   added: (contains shot1 ingredient2) (used shot1 ingredient2)
   goals met: 1 of 4
40. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
41. (pour_shot_to_used_shaker shot1 ingredient2 shaker1 right l1 l2)
   deleted: (contains shot1 ingredient2) (shaker_level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot1) (shaker_level shaker1 l2)
   goals met: 1 of 4
42. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
43. (clean_shot shot1 ingredient2 right left)
   deleted: (used shot1 ingredient2)
   added: (clean shot1)
   goals met: 1 of 4
44. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 1 of 4
45. (leave right shot1)
   deleted: (holding right shot1)
   added: (handempty right) (ontable shot1)
   goals met: 1 of 4
46. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 1 of 4
47. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 1 of 4
48. (refill_shot shot4 ingredient1 right left dispenser1)
   deleted: (empty shot4)
   added: (contains shot4 ingredient1)
   goals met: 2 of 4
49. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 2 of 4
50. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 2 of 4
51. (shake cocktail1 ingredient2 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 2 of 4
52. (pour_shaker_to_shot cocktail1 shot2 left shaker1 l2 l1)
   deleted: (clean shot2) (empty shot2) (shaker_level shaker1 l2)
   added: (contains shot2 cocktail1) (shaker_level shaker1 l1)
   goals met: 3 of 4
53. (empty_shaker left shaker1 cocktail1 l1 l0)
   deleted: (shaked shaker1) (shaker_level shaker1 l1) (contains shaker1 cocktail1)
   added: (shaker_level shaker1 l0) (empty shaker1)
   goals met: 3 of 4
54. (clean_shaker left right shaker1)
   added: (clean shaker1)
   goals met: 3 of 4
55. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 3 of 4
56. (pour_shot_to_clean_shaker shot4 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot4 ingredient1) (empty shaker1) (clean shaker1) (shaker_level shaker1 l0)
   added: (empty shot4) (contains shaker1 ingredient1) (unshaked shaker1) (shaker_level shaker1 l1)
   goals met: 2 of 4
57. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 2 of 4
58. (grasp right shot5)
   deleted: (ontable shot5) (handempty right)
   added: (holding right shot5)
   goals met: 2 of 4
59. (pour_shot_to_used_shaker shot5 ingredient2 shaker1 right l1 l2)
   deleted: (contains shot5 ingredient2) (shaker_level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot5) (shaker_level shaker1 l2)
   goals met: 2 of 4
60. (leave right shot5)
   deleted: (holding right shot5)
   added: (handempty right) (ontable shot5)
   goals met: 2 of 4
61. (shake cocktail2 ingredient2 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 2 of 4
62. (pour_shaker_to_shot cocktail2 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker_level shaker1 l2)
   added: (contains shot1 cocktail2) (shaker_level shaker1 l1)
   goals met: 3 of 4
63. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 3 of 4
64. (grasp left shot4)
   deleted: (ontable shot4) (handempty left)
   added: (holding left shot4)
   goals met: 3 of 4
65. (refill_shot shot4 ingredient1 left right dispenser1)
   deleted: (empty shot4)
   added: (contains shot4 ingredient1)
   goals met: 4 of 4
